<?php
if(!defined('IN_UCHOME')) exit('Access Denied');
$_SGLOBAL['profield']=Array
	(
	1 => Array
		(
		'fieldid' => 1,
		'title' => '社团工作群组',
		'note' => '<p>社团工作群组</p><p>社团可以申请自己的工作群</p>功能：<br/>A.创建社团公告<br/>B.创建社团成员列表（备注：增加新成员并搭建社团成员架构）<br/>C.创建社团制作过的广播剧列表<br/>D.创建社团成员招募<br/>E.创建社团和粉丝的交流讨论区（备注：可创建新话题分类）<br/>F.创建粉丝管理<br/>',
		'displayorder' => 1
		),
	5 => Array
		(
		'fieldid' => 5,
		'title' => '工作室群组',
		'note' => '<p>工作室群组</p><p>工作室可以申请自己的工作群</p>功能：<br/>A.创建工作室公告<br/>B.创建成员列表（备注：增加新成员并搭建工作室成员架构）<br/>C.创建工作室制作过的广播剧列表<br/>D.创建工作室成员招募<br/>E.创建工作室和粉丝的交流讨论区（备注：可创建新话题分类）<br/>F.创建粉丝管理<br/>',
		'displayorder' => 2
		),
	2 => Array
		(
		'fieldid' => 2,
		'title' => '广播剧制作群组',
		'note' => '<p>广播剧制作群组</p><p>正在策划制作的广播剧可以建立相应群组</p>功能：<br/>A.创建制作组公告<br/>B.创建制作组成员列表（备注：增加新成员并搭建制作组成员架构）<br/>C.创建制作组工作进度列表<br/>D.创建制作组招募<br/>E.创建制作组和粉丝的交流讨论区（备注：可创建新话题分类）<br/>F.创建粉丝管理<br/>',
		'displayorder' => 3
		),
	3 => Array
		(
		'fieldid' => 3,
		'title' => 'CV的粉丝群组',
		'note' => '<p>CV的粉丝群组</p><p>CV可以申请或者授权开设自己的粉丝群</p>功能：<br/>A.创建粉丝群公告<br/>B.创建粉丝群成员列表（备注：增加新成员并搭建粉丝群成员架构）<br/>C.创建粉丝群活动<br/>',
		'displayorder' => 4
		),
	4 => Array
		(
		'fieldid' => 4,
		'title' => '七嘴八舌群组',
		'note' => '<p>七嘴八舌群组</p><p>个人可以申请或者授权开设兴趣相关讨论群</p>功能：<br/>A.创建讨论群公告<br/>B.创建讨论群成员列表（备注：增加新成员并搭建讨论群成员架构）<br/>C.创建讨论群活动<br/>D.创建讨论群招募<br/>',
		'displayorder' => 5
		)

	)
?>